# Сортировка словарей

# Задача: есть словарь, который хранит прямо слова.
# Настоящие. Задача №1: вывести слова в алфавитном порядке,
# к каждому вывести перевод. Пример:



'''manywords = {
    'spring': ['пружина', 'весна', 'ключ', 'родник'],
    'key':    ['ключ', 'клавиша'],
    'cat':    ['кот'],
    'boy':    ['мальчик'],
    'girl':   ['девочка'],
} '''

slovo = {
    'spring': ['пружина'],
    'spring': ['весна'],
    'spring': ['ключ'],
    'spring': ['родник'],
    'key':['ключ'],
    'key':['клавиша'],
     'cat':['кот'], 
     'boy': ['мальчик'], 
     'girl': ['девочка']

}
voc = sorted(slovo.items()) # Сортировка по ключу

for rus, eng in voc: # перебор ключ значение
    print(f'Слово-{rus}, перевод-{eng}')





'''print(voc)
all_word = {}

for word_eng in slovo:
    for word_rus in slovo[word_eng]:

        print(word_rus)'''


